In [26]:
from query_utils import connect_catalog

In [28]:
con = connect_catalog()

✅ 已成功连接并切换至 Catalog: C:\Users\mu\Desktop\the-nomad-data-stack\.duckdb\catalog.duckdb

In [30]:
con.execute("SHOW ALL TABLES;").df()

,database,schema,name,column_names,column_types,temporary
0,catalog,catalog_meta,schema_migrations,"[filename, checksum, applied_at]","[VARCHAR, VARCHAR, TIMESTAMP]",False
1,catalog,ods,ods_etf_universe_whitelist,"[symbol, name, enabled, trade_date, dt]","[VARCHAR, VARCHAR, INTEGER, DATE, VARCHAR]",False
2,catalog,ods,ods_fund_etf_history,"[symbol, trade_date, open, high, low, close, v...","[VARCHAR, DATE, DOUBLE, DOUBLE, DOUBLE, DOUBLE...",False
3,catalog,ods,ods_fund_etf_spot,"[symbol, name, amount, trade_date, dt]","[VARCHAR, VARCHAR, DOUBLE, DATE, VARCHAR]",False
4,catalog,ods,ods_trade_date_hist,"[trade_date, dt]","[DATE, VARCHAR]",False

In [34]:
con.sql("select * from ods.ods_trade_date_hist").df()

     trade_date          dt
0    1990-12-19  2025-12-22
1    1990-12-20  2025-12-22
2    1990-12-21  2025-12-22
3    1990-12-24  2025-12-22
4    1990-12-25  2025-12-22
...         ...         ...
8792 2026-12-25  2025-12-22
8793 2026-12-28  2025-12-22
8794 2026-12-29  2025-12-22
8795 2026-12-30  2025-12-22
8796 2026-12-31  2025-12-22

[8797 rows x 2 columns]

In [22]:
con.close()